{
  "title": "Eminem",
  "artists": [
    "Mocking Bird"
  ],
  "blocks": [
    [
      "I know sometimes things may not always make sense to you right now",
      "but hey, what daddy always tell you?",
      "Straighten up little soldier",
      "Stiffen up that upper lip",
      "what you crying about?",
      "You got me."
    ],
    [
      "Hailie, I know you miss your mom, and I know you miss your dad",
      "When I\u0027m gone but I\u0027m trying to give you the life that I never had",
      "I can see you\u0027re sad, even when you smile, even when you laugh",
      "I can see it in your eyes, deep inside you want to cry",
      "\u0027Cause you\u0027re scared, I ain\u0027t there?",
      "Daddy\u0027s with you in your prayers",
      "No more crying, wipe them tears",
      "Daddy\u0027s here, no more nightmares",
      "We gon\u0027 pull together through it, we gon\u0027 do it",
      "Lainie Uncle\u0027s crazy, ain\u0027t he?",
      "Yeah, but he loves you girl and you better know it",
      "We\u0027re all we got in this world",
      "When it spins, when it swirls",
      "When it whirls, when it twirls",
      "Two little beautiful girls",
      "Lookin\u0027 puzzled, in a daze",
      "I know it\u0027s confusing you",
      "Daddy\u0027s always on the move, mamma\u0027s always on the news",
      "I try to keep you sheltered from it but somehow it seems",
      "The harder that I try to do that, the more it backfires on me",
      "All the things growing up as daddy, that he had to see",
      "Daddy don\u0027t want you to see but you see just as much as he did",
      "We did not plan it to be this way, your mother and me",
      "But things have gotten so bad between us",
      "I don\u0027t see us ever being together ever again",
      "Like we used to be when we was teenagers",
      "But then of course everything always happens for a reason",
      "I guess it was never meant to be",
      "But it\u0027s just something we have no control over and that\u0027s what destiny is",
      "But no more worries, rest your head and go to sleep",
      "Maybe one day we\u0027ll wake up and this will all just be a dream"
    ],
    [
      "Chorus",
      "Now hush little baby, don\u0027t you cry",
      "Everything\u0027s gonna be alright",
      "Stiffen that upper lip up, little lady, I told ya",
      "Daddy\u0027s here to hold ya through the night",
      "I know mommy\u0027s not here right now and we don\u0027t know why",
      "We feel how we feel inside",
      "It may seem a little crazy, pretty baby",
      "But I promise mama\u0027s gon\u0027 be alright"
    ],
    [
      "It\u0027s funny",
      "I remember back one year when daddy had no money",
      "Mommy wrapped the Christmas presents up",
      "And stuck \u0027em under the tree and said some of \u0027em were from me",
      "\u0027Cause daddy couldn\u0027t buy \u0027em",
      "I\u0027ll never forget that Christmas I sat up the whole night crying",
      "\u0027Cause daddy felt like a bum, see daddy had a job",
      "But his job was to keep the food on the table for you and mom",
      "And at the time every house that we lived in",
      "Either kept getting broken into and robbed",
      "Or shot up on the block and your mom was saving money for you in a jar",
      "Tryna start a piggy bank for you so you could go to college",
      "Almost had a thousand dollars \u0027til someone broke in and stole it",
      "And I know it hurt so bad it broke your mamma\u0027s heart",
      "And it seemed like everything was just startin\u0027 to fall apart",
      "Mom and dad was arguin\u0027 a lot so momma moved back",
      "On the Chalmers in the flat one bedroom apartment",
      "And dad moved back to the other side of 8 Mile on Novara",
      "And that\u0027s when daddy went to California with his CD and met Dr. Dre",
      "And flew you and momma out to see me",
      "But daddy had to work, you and momma had to leave me",
      "Then you started seeing daddy on the T.V. and momma didn\u0027t like it",
      "And you and Lainnie were too young to understand it",
      "That papa was a rollin\u0027 stone, momma developed a habit",
      "And it all happened too fast for either one of us to grab it",
      "I\u0027m just sorry you were there and had to witness it first hand",
      "\u0027Cause all I ever wanted to do was just make you proud",
      "Now I\u0027m sitting in this empty house, just reminiscing",
      "Lookin\u0027 at your baby pictures, it just trips me out",
      "To see how much you both have grown, it\u0027s almost like you\u0027re sisters now",
      "Wow, I guess you pretty much are and daddy\u0027s still here",
      "Lainnie I\u0027m talkin\u0027 to you too, daddy\u0027s still here",
      "I like the sound of that, yeah",
      "It\u0027s got a ring to it don\u0027t it?",
      "Shh, mama\u0027s only gone for the moment"
    ],
    [
      "Chorus",
      "Now hush little baby, don\u0027t you cry",
      "Everything\u0027s gonna be alright",
      "Stiffen that upper lip up, little lady, I told ya",
      "Daddy\u0027s here to hold ya through the night",
      "I know mommy\u0027s not here right now and we don\u0027t know why",
      "We feel how we feel inside",
      "It may seem a little crazy, pretty baby",
      "But I promise mama\u0027s gon\u0027 be alright"
    ],
    [
      "And if you ask me too",
      "Daddy\u0027s gonna buy you a mockingbird",
      "I\u0027mma give you the world",
      "I\u0027mma buy a diamond ring for you",
      "I\u0027mma sing for you",
      "I\u0027ll do anything for you to see you smile",
      "And if that mockingbird don\u0027t sing and that ring don\u0027t shine",
      "I\u0027mma break that birdie\u0027s neck",
      "I\u0027ll go back to the jeweler who sold it to ya",
      "And make him eat every carat don\u0027t fuck with dad (ha ha)"
    ]
  ]
}